backend/app/models/appointment.rb

SELECT 1 AS one FROM "appointments" WHERE "appointments"."status" != 2 AND (start_time < '2026-03-13 10:30:00' AND end_time > '2026-03-13 09:00:00') LIMIT 1
---
  def no_overlapping_appointments
    return unless start_time && end_time
    overlapping = Appointment.where.not(status: :cancelled)
      .where('start_time < ? AND end_time > ?', end_time, start_time)
    overlapping = overlapping.where.not(id: id) if persisted?
    errors.add(:base, "Time slot is already booked") if overlapping.exists?