backend/app/controllers/application_controller.rb

  def authenticate_admin!
    token = request.headers['Authorization']&.split(' ')&.last
    unless token
      render json: { error: 'Unauthorized' }, status: :unauthorized
      return
    end

    begin
      decoded = JWT.decode(token, Rails.application.credentials.secret_key_base, true, algorithm: 'HS256')
      @current_admin = AdminUser.find(decoded[0]['admin_id'])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = 1 LIMIT 1