backend/app/controllers/api/v1/appointments_controller.rb

      def create
        service = Service.active.find(params[:service_id])
        appointment = Appointment.new(appointment_params)
        appointment.service = service
        appointment.end_time = appointment.start_time + service.duration_minutes.minutes if appointment.start_time

        if appointment.save
---
SELECT "services".* FROM "services" WHERE "services"."active" = TRUE AND "services"."id" = 7 LIMIT 1
INSERT INTO "appointments" ("client_name", "client_phone", "client_email", "service_id", "start_time", "end_time", "status", "language_used", "notes", "created_at", "updated_at") VALUES ('Хуй зна хто', '123456', '', 7, '2026-03-13 09:00:00', '2026-03-13 10:30:00', 0, 'uk', '', '2026-03-11 22:33:16.531361', '2026-03-11 22:33:16.531361') RETURNING "id"