backend/app/controllers/api/v1/available_slots_controller.rb

      def index
        date = Date.parse(params[:date])
        service = Service.active.find(params[:service_id])
        duration = service.duration_minutes

        # Get work schedule for that day
        schedule = WorkSchedule.find_by(day_of_week: date.wday)

        if schedule.nil? || schedule.is_day_off? || Holiday.exists?(date: date)
          render json: { slots: [], message: 'Not a working day' }
          return
        end

        # Generate all possible slots
        slots = generate_slots(date, schedule, duration)

        # Remove slots that overlap with existing appointments
        booked = Appointment.where.not(status: :cancelled)
          .where('start_time >= ? AND start_time < ?', date.beginning_of_day, date.end_of_day)
          .pluck(:start_time, :end_time)

        # Remove slots that overlap with breaks
        breaks = schedule.schedule_breaks.pluck(:start_time, :end_time)
---
SELECT "services".* FROM "services" WHERE "services"."active" = TRUE AND "services"."id" = 1 LIMIT 1
SELECT "work_schedules".* FROM "work_schedules" WHERE "work_schedules"."day_of_week" = 5 LIMIT 1
SELECT 1 AS one FROM "holidays" WHERE "holidays"."date" = '2026-03-13' LIMIT 1
SELECT "appointments"."start_time", "appointments"."end_time" FROM "appointments" WHERE "appointments"."status" != 2 AND (start_time >= '2026-03-13 00:00:00' AND start_time < '2026-03-13 23:59:59.999999')
SELECT "schedule_breaks"."start_time", "schedule_breaks"."end_time" FROM "schedule_breaks" WHERE "schedule_breaks"."work_schedule_id" = 6