backend/app/controllers/api/v1/admin/appointments_controller.rb

        def index
          appointments = Appointment.includes(:services).order(start_time: :desc)

          if params[:status].present?
            appointments = appointments.where(status: params[:status])
          end

          if params[:date].present?
            date = Date.parse(params[:date])
            appointments = appointments.where(start_time: date.beginning_of_day..date.end_of_day)
          end

          if params[:from].present? && params[:to].present?
            from = Date.parse(params[:from])
            to = Date.parse(params[:to])
            appointments = appointments.where(start_time: from.beginning_of_day..to.end_of_day)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."start_time" BETWEEN '2026-03-13 00:00:00' AND '2026-03-13 23:59:59.999999' ORDER BY "appointments"."start_time" DESC

        def update
          assign_services(@appointment) if params[:appointment][:service_ids].present? && !@appointment.is_time_off

          if @appointment.update(update_params)
---
UPDATE "appointments" SET "status" = 1, "updated_at" = '2026-03-11 22:35:52.463613' WHERE "appointments"."id" = 1