backend/app/controllers/api/v1/admin/auth_controller.rb

        def login
          admin = AdminUser.find_by(email: params[:email])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."email" = 'admin@beautysalon.com' LIMIT 1