backend/app/controllers/api/v1/admin/dashboard_controller.rb

        def index
          today = Date.current
          week_start = today.beginning_of_week
          week_end = today.end_of_week
          month_start = today.beginning_of_month
          month_end = today.end_of_month

          today_appointments = Appointment.where(start_time: today.beginning_of_day..today.end_of_day)
                                          .where.not(status: :cancelled)
          week_appointments = Appointment.where(start_time: week_start.beginning_of_day..week_end.end_of_day)
                                         .where.not(status: :cancelled)
          month_appointments = Appointment.where(start_time: month_start.beginning_of_day..month_end.end_of_day)
                                          .where.not(status: :cancelled)

          upcoming = Appointment.includes(:service)
                                .where('start_time > ?', Time.current)
                                .where.not(status: :cancelled)
                                .order(start_time: :asc)
                                .limit(10)

          render json: {
            today_count: today_appointments.count,
            week_count: week_appointments.count,
            month_count: month_appointments.count,
            week_revenue: week_appointments.joins(:service).sum('services.price'),
            month_revenue: month_appointments.joins(:service).sum('services.price'),
            upcoming_appointments: upcoming.as_json(include: :service),
            total_services: Service.active.count,
            pending_count: Appointment.pending.where('start_time > ?', Time.current).count
---
SELECT "appointments".* FROM "appointments" WHERE (start_time > '2026-03-11 21:59:14.608672') AND "appointments"."status" != 2 ORDER BY "appointments"."start_time" ASC LIMIT 10
SELECT SUM("services"."price") FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."start_time" BETWEEN '2026-03-09 00:00:00' AND '2026-03-15 23:59:59.999999' AND "appointments"."status" != 2