backend/app/controllers/api/v1/admin/services_controller.rb

        def index
          services = Service.all.order(created_at: :desc)
---
SELECT "services".* FROM "services" ORDER BY "services"."created_at" DESC