backend/app/controllers/api/v1/admin/work_schedules_controller.rb

        def index
          schedules = WorkSchedule.includes(:schedule_breaks).order(:day_of_week)
---
SELECT "schedule_breaks".* FROM "schedule_breaks" WHERE "schedule_breaks"."work_schedule_id" IN (1, 2, 3, 4, 5, 6, 7)
SELECT "work_schedules".* FROM "work_schedules" ORDER BY "work_schedules"."day_of_week" ASC